Repository: Kredeum/kredeum
Catalog: wordpress/plugins/kredeum-nfts/languages/kredeum-nfts-*.po
Languages: fr_fr

source: media link modified
fr_fr: lien modifié

source: media link unchanged
fr_fr: lien inchangé

source: %s media archived to
fr_fr: %s média archivé sur

source: and related
fr_fr: et

source: Archive link
fr_fr: Lien d'Archive

source: Archive to
fr_fr: Archiver sur

source: Choose "yes" to automaticaly push your new medias to decentralized storage on upload
fr_fr: Choisissez "Oui" pour pousser automatiquement vos média vers un stockage décentralisé après chargement

source: Enter your own NFT Storage Key, or leave blank to use common key
fr_fr: Entrez votre propre clef NFT Storage, ou laisser vide pour utiliser la clef commune

source: For any help read the
fr_fr: Pour vous aider consultez le

source: For degens ! Choose "yes" to use beta features...
fr_fr: Pour les degens ! Choisissez "Oui" pour utiliser les fonctionnalités en beta...

source: Decentralized Archive
fr_fr: Archive Décentralisée

source: My NFTs
fr_fr: Mes NFTs

source: NFTs settings
fr_fr: Paramétrages

source: No
fr_fr: Non

source: Not allowed
fr_fr: Accès interdit

source: or join us on
fr_fr: ou rejoignez-nous sur

source: Plugin to archive your medias to decentralized storage and mint them as NFTs
fr_fr: Plugin pour archiver vos medias sur un stockage décentralisé et les minter en NFTs

source: Settings
fr_fr: Paramétrages

source: Settings instructions
fr_fr: Instructions de paramétrage

source: Setup here your decentralized storage options and connect your Metamask account with WordPress
fr_fr: Paramétrez vos options de stockage décentralisé et connectez votre Metamask avec WordPress

source: User Guide
fr_fr: Guide d'Utilisation

source: Yes
fr_fr: Oui
