Repository: Kredeum/kredeum
Catalog: wordpress/svn/tags/0.4.7/languages/kipfs-*.po
Languages: fr_fr

source: %s IPFS media link modified
fr_fr: %s lien IPFS modifié

source: %s IPFS media link unchanged
fr_fr: %s lien IPFS inchangé

source: %s media archived to IPFS
fr_fr: %s media archivé sur IPFS

source: Allow media storage into IPFS
fr_fr: Archive vos médias sur IPFS

source: Archive to IPFS
fr_fr: Archiver sur IPFS

source: Check to automaticaly push your new medias to IPFS on upload
fr_fr: Cocher pour pousser automatiquement vos média vers IPFS après chargement

source: Choose IPFS CID version
fr_fr: Choisissez la version de CID pour IPFS

source: Choose your prefered IPFS gateway
fr_fr: Choisissez votre passerelle IPFS préférée

source: Here you can set IPFS options
fr_fr: Définissez ici vos réglages pour IPFS

source: https://www.kredeum.com
fr_fr: https://www.kredeum.com/fr

source: IPFS archive link
fr_fr: Lien archive IPFS

source: IPFS settings
fr_fr: Réglages IPFS

source: No
fr_fr: Non

source: Not allowed
fr_fr: Accès interdit

source: Settings
fr_fr: Réglages

source: Yes
fr_fr: Oui
