{
  "content": {
    "body": "*Originally published in [Harvard Business Review](https://hbr.org/2022/05/web3-is-our-chance-to-make-a-better-internet)*\n\n![Magdiel Lopez/Belmont Creative](https://images.mirror-media.xyz/publication-images/l1XJy1JFXZ7Baf8P8i16W.png?height=675&width=1200)\n\nBy Li Jin and Katie Parrott\n\nOne of the most powerful narratives surrounding [web3](https://hbr.org/2022/05/what-is-web3) is that it is a movement toward a better, fairer internet. Specifically, web3 proponents envision an internet in which users can wrest back power from a small number of extractive, centralized institutions, and in which everyone with an internet connection can participate on a level playing field.\n\nBut web2 started with a similar promise of empowering individual creators and removing intermediaries — a promise left unfulfilled. Now, standing at the precipice of a new era of the internet, we should ask ourselves: Is web3 actually democratizing opportunity? And if not, how can we better design platforms and governance systems to promote fairness?\n\nThe social and political philosopher John Rawls’ thought experiment known as the “veil of ignorance,” proposed in his influential 1971 work *A Theory of Justice,* provides a useful framework for these questions. When creating the foundations for an ideal society, Rawls contends, we should imagine that we do not know where we ourselves would fall within it — that is, we should adopt a veil of ignorance. A just society is one “that if you knew everything about it, you’d be willing to enter it in a random place.” Rawls adds:\n\n> Among the essential features of this situation is that no one knows his place in society, his class position or social status, nor does anyone know his fortune in the distribution of natural assets and abilities, his intelligence, strength, and the like. I shall even assume that the parties do not know their conceptions of the good or their special psychological propensities.\n\nRawls’ thought experiment is particularly relevant now because we are standing at precisely the kind of inflection point that the veil of ignorance imagines. Web3 presents the opportunity to build an entirely new internet — indeed, entire new economies — from scratch. The question then becomes: What kind of internet should we be creating?\n\nSome might say that web3 is young, and these issues will simply work themselves out over time. But questions about impacts and externalities were left too late in the design of web2, with consequences ranging from election manipulation to widespread vaccine misinformation. Some [indicators](https://www.cnbc.com/2021/08/30/cryptocurrency-has-a-big-gender-problem.html)[ show](https://www.frontiersin.org/articles/10.3389/fbloc.2021.730122/full) that early design choices in web3 are replicating or compounding the inequalities of web2 and the real world.\n\nIf we want web3 to make good on the promise that it can materially improve the situations of *everyone* within the ecosystem, and not just a handful of people at the top, we need to design it according to principles that will make that happen.\n\n**✓**\n\n## How Do We Decide What’s Fair?\n\nPhilosophers and thinkers have been debating for centuries how best to allocate resources among participants in a society. The body of thought devoted to answering these questions is known as “distributive justice,” and there are varying schools of thought within the discipline:\n\n* **Strict egalitarians** argue that the only just system is one in which resources are distributed absolutely equally — in other words, everyone should have the same amount of material goods. The principle is rooted in the belief that everyone is morally equal, and thus deserves to have equal access to materials and services.\n* **Luck egalitarians** argue that what’s important is equality of *starting* position, and that any inequalities that emerge after that point are justified by differences in merit.\n* **Libertarians** argue that individual freedom should be the sole consideration, and that any effort to redistribute resources infringes on that freedom.\n* **Utilitarians** argue that the most just system is the one that maximizes the sum of total happiness and well-being of all participants. Under utilitarianism, redistribution of wealth would be desirable because each marginal dollar would do more to raise the well-being of a poor person than a wealthy person.\n\nCommon among these theories of justice is a tension between two equally important yet often opposing values: freedom and equality. A society in which all actors are completely free is likely to result in a significant amount of inequality, since individuals differ in their motivation to pursue wealth and will behave in ways that advance their own interests. Conversely, a society that is completely equal inhibits freedom, since individuals cannot behave in any way that causes them to be unequal to others — even if that unequal outcome is “earned” through hard work or skill.\n\nUsing veil-of-ignorance reasoning, Rawls introduced his own theory of distributive justice, known as “justice as fairness.” It has two parts: the greatest equal liberty principle and the difference principle. The *greatest equal liberty principle* affords all citizens equal rights and liberties to the fullest extent that’s compatible with others also having those liberties. Justice requires equal rights for every person.\n\nThe *difference principle* says that any social or economic inequalities that *do* exist in society should meet two conditions. First, they must be “attached to offices and positions open to all under conditions of fair equality and opportunity.” Social positions, such as jobs, should be open to everyone and allocated by merit. In other words, a person’s prospects for success should reflect their level of talent and willingness to use it, not their social class or background. And second, any inequality that does exist should maximize the benefit of the least well off. This is a profound principle. Under this principle, it’s acceptable that doctors earn more than janitors, because that compensation differential incentivizes doctors to pursue their careers and ensures that janitors (and everyone else) will receive quality care if they fall ill.\n\nRawls’ [theory is nuanced](https://plato.stanford.edu/entries/rawls/#JusFaiJusWitLibSoc), but in short, it’s unique in how it resolves the central tension between the competing demands of freedom and equality. By requiring that inequalities benefit the least advantaged, Rawls builds in a natural corrective to the rampant inequality that would otherwise emerge in a system that privileges freedom above all else.\n\nThis balance between freedom and equality makes Rawls’ theory compelling as a philosophical framework for the internet. It leaves space for builders to be rewarded for their contributions, which is necessary to foster incentives for smart, ambitious people to build in the ecosystem. At the same time, it places a burden on those builders — and the ecosystem as a whole — to build in a way that creates opportunity for less-advantaged participants.\n\n## Evaluating the Current Internet Against Justice as Fairness\n\nHow well does the current internet abide by Rawls’ principles? In many ways, the web2 internet has expanded and enhanced opportunity for a broad set of people and exists in closer accordance to Rawls’ difference principle than the pre-internet world. Before the internet, access to participation in various industries was limited by a handful of gatekeepers, ranging from movie studios to music labels. The internet and social media platforms made it possible for anyone to participate in content creation and distribution, and therefore enabled more creators to succeed.\n\nBut you don’t have to look far for evidence that the web2 internet falls short of the mark in other ways. Consider just a few examples of how web2 platforms have inhibited equality and violate the difference principle: Gig economy platforms bring in billions of dollars in revenue, while the frontline workers who deliver their services earn [poverty wages](https://www.theguardian.com/technology/2019/may/07/uber-drivers-feel-poor-powerless-ipo-looms) and are shut out of decisions that impact their lives. Social media companies and media platforms earn billions of dollars in ad revenue from algorithmic feeds that [elevate misinformation](https://www.npr.org/2022/01/21/1074442185/joe-rogan-doctor-covid-podcast-spotify-misinformation) and [damage vulnerable communities](https://www.theguardian.com/technology/2021/oct/07/facebooks-role-in-myanmar-and-ethiopia-under-new-scrutiny). Platforms’ creator funds typically reward creators with the most [views and engagement](https://newsroom.tiktok.com/en-gb/tiktok-creator-fund-your-questions-answered), leading to the concentration of income among those who already have ample sources of revenue while failing to broaden access for less-well-off [aspiring creators](https://li.substack.com/p/the-case-for-universal-creative-income). And we’ve [written before](https://every.to/means-of-creation/the-web3-renaissance-a-golden-age-for-content) about how the internet’s original sin of not enabling payments led to the extractive, advertising-based business models that define the web2 economy today.\n\nBut it’s not just web2 platforms that fail to reach Rawls’ standard of justice. Web3 in its current form is also exacerbating inequalities. Web3 projects commonly issue crypto tokens as digital representations of value. Early versions of token distributions have led to unsustainable dynamics wherein speculators are rewarded instead of those who are adding consistent value to networks through actual usage. Some play-to-earn games have implemented [dual-token systems](https://widiland.substack.com/p/tokenomics-part-2-dual-token-model?s=r) in which users earn income but not governance power, creating the risk of replicating the dynamics of the current economy in which workers earn salary but not equity, compounding wealth inequality. Business writer Evan Armstrong points to strong parallels between some current NFT projects and [multi-level marketing schemes](https://every.to/napkin-math/nft-projects-are-just-mlms-for-tech-elites), in which later arrivals to the ecosystem are structurally unable to achieve the same level of success as early adopters due to system design.\n\n## How to Ensure Justice as Fairness in Web3\n\nWe’ve seen how both the web2 internet and early iterations of web3 fall short of ensuring a free, fair playing field that benefits the least advantaged. So what would an internet that meets Rawls’ standards look like? Some general anti-principles start to come into focus:\n\n* Don’t build a system that only benefits the wealthy, because what if you’re poor?\n* Don’t build a system that disproportionately favors early adopters, because what if you’re not embedded in networks that give you early access to knowledge?\n* Don’t build a system that demands extreme technological savvy to succeed, because what if you don’t have the aptitude or resources to learn those skills?\n\nUsing these anti-principles as guides, builders and participants of the web3 ecosystem can do three things to ensure it aligns with Rawls’ ideals of liberty, equality, and the difference principle: First, promote self-determination and agency. Second, reward participation, not just capital. And third, incorporate initiatives that benefit the disadvantaged.\n\n### Promote self-determination and agency.\n\nOne of the flagship principles of web3 is the idea of self-determination: Unlike in web2 platforms, with a cadre of founders, executives, and shareholders holding all the power, web3 communities will be controlled by their members. This would be consistent with economist Albert O. Hirschman’s “Exit-Voice-Loyalty” model, which describes the choices individuals have when confronted with dissatisfactory situations in organizations and states. Ideally, on web3 platforms, users can voice concerns to try to change their situation; exit to new platforms; or wait, out of loyalty, for the situation to resolve.\n\nBut the reality today is more complex. Early governance structures have largely instituted token-weighted voting, with the result being plutocracies that are not all that different from the boardrooms they’re meant to be a corrective to. And the problem with plutocracy, whether it happens in a boardroom or a DAO Discord channel, is that the people holding the power are likely to look out for their own interests.\n\nAs a first step in aligning web3’s future with Rawls’ principles of justice, participants and builders of the web3 ecosystem need to push for democratic systems of governance that give a voice to all its members, not just a select few. Everyone should be equally enfranchised in the systems in which they participate.\n\nThere are additional systems of governance that can combat plutocracy, such as:\n\n* **Reputation-based governance:** According greater governance power to those with higher reputational value.\n* **Delegation:** Enabling community members to nominate others to vote on their behalf.\n* **Pods/subDAOs:** Smaller groups within an organization whose scope of governance can be constrained to their missions.\n\nAn example of a project purposefully diversifying its member base is Mirror’s [airdrop of the $WRITE token](https://mirror.xyz/airdrop), which is needed to register a custom subdomain on the platform — and, in the future, to participate in governance. To broaden the base of users who would be able to influence governance, tokens were distributed according to an algorithm designed to maximize diverse social clusters. According to Mirror, this airdrop “further democratizes the selection process and broadens the criteria for entry…the expansion of the Mirror community will be determined by those who have been most integral in shaping it thus far.”\n\nBeyond the importance of voice — the ability for people to change a system from within through governance — participants also need a viable path to *[exit](https://en.wikipedia.org/wiki/Exit,_Voice,_and_Loyalty)*. Web2 platforms coerce user loyalty through network effects and closed data, and exiting a platform leaves creators without access to their audiences or content. Web3 affords the opportunity to build systems that foster user agency and self-determination through true digital ownership, open data, and networks that are built atop open-source software.\n\n### Reward participation, not just capital.\n\nA core philosophical tenet of web3 is that there are more ways to provide value to an ecosystem than through capital — and furthermore, that value should be able to be earned, not just purchased. This is a radical departure from the existing structure, where those with capital earn more through investments than people can earn through work — resulting in a widening wealth gap over time.\n\nDistribution of ownership to participants is also a major shift away from how incumbent platforms are built, wherein meaningful ownership accrues to employees and investors but excludes users whose content and contributions make those platforms valuable.\n\nAn important step in aligning web3 with the principles of justice as fairness is to ensure that everyone is on an equal footing and can attain positions of power or compensation through their own merit and contributions. The reality so far has been that those in the right knowledge networks can compound their wealth through strategies like sybil farming (creating multiple accounts) to receive additional token airdrops. And while early distributions of tokens often perversely incentivized short-term mercenary behavior — like participating in yield farms then exiting them [days later in search of higher yields](https://www.nansen.ai/research/all-hail-masterchef-analysing-yield-farming-activity) — there is an opportunity to iterate and improve the process to support networks’ long-term retention and sustainability. One way is by making it possible to earn ownership through ongoing participation in networks, not just capital investment. Projects that are working to expand access to ownership through active contribution include [RabbitHole](https://rabbithole.gg/), [Layer3](https://alpha.layer3.xyz/), [Gitcoin](https://gitcoin.co/earn), [BanklessDAO](https://www.bankless.community/), and [FWB](http://fwb.help/).\n\n### Incorporate initiatives that benefit the disadvantaged.\n\nThe difference principle is grounded in the idea that inequality, per se, is not a bad thing. With fair equality of opportunity as a prerequisite, inequality remains an inevitable outcome of people’s natural abilities and level of desire and effort to earn money. But when inequalities do arise, do those arrangements benefit those less privileged in society?\n\nThis is a challenging principle to apply in the context of technology. But consider this thought exercise: Do the current social networking feed algorithms promote content that maximizes the benefit to the least well off? For platform [creator](https://newsroom.tiktok.com/en-gb/the-tiktok-creator-fund-is-now-live-across-europe-and-here-is-how-to-apply)[ funds](https://about.fb.com/news/2021/07/investing-1-billion-dollars-in-creators/) that give payments to content creators, predicated on views and engagement: Do such inequalities in payouts maximize the benefit to the least well off among their users? The answer is likely no. While top creators have a plethora of ways to monetize and can sustain their output regardless of creator fund payouts, the least well off may not even participate in content creation due to [financial constraints](https://li.substack.com/p/the-case-for-universal-creative-income?s=w).\n\nThe difference principle will be particularly important to the democratization of web3, since participants will enter the ecosystem at different times with a wide variety of backgrounds, incomes, and technological fluency and access. There are already many examples of projects leveraging crypto to maximize the well-being of the least well off. For example, [SuperHi](https://www.superhi.com/), a for-profit creative education platform that is planning to decentralize ownership to its members and instructors, tested a basic income program with the goal of broadening access to creative careers. Projects like [Proof of Humanity](https://www.proofofhumanity.id/) and [ImpactMarket](http://impactmarket.com/) seek to use blockchain technology as a foundation to provide basic income to those in need. Communities like [LaborDAO](https://mirror.xyz/0x41E84f0e4417eDf440DDc2558Df13877552Db39A/C7befGqsLiT9Z4VSLT-bqpacg1nxoqpnOq3Q7elXo9U) are leveraging building blocks to build worker power, while others like [she256](https://she256.org/), [We3](https://www.hello-we3.com/), and [Komorebi Collective](https://syndicate.io/syndicate/komorebi_collective) are focused on increasing diversity in the blockchain space.\n\nBesides projects that have social good as an explicit mission, all web3 networks should be incentivized to adhere to the difference principle and maximize benefit to the least well off, since that approach maximizes attractiveness to new participants, propelling further network effects. A just network is one in which participants would be willing to enter at any time, at any position, with any level of tokens.\n\n## A Fair, Just Internet Is Possible\n\nWeb3 offers the opportunity for a meaningful course correction — a chance to reimagine the internet and build new platforms from first principles. But in order to do that, we need to agree on what those principles should be, and why. Rawls’ principles of justice provide a useful starting point. Without full knowledge of where our positions will be, our aim should be to design new systems rooted in fairness and consideration for all.\n\n**✓**\n\n\n---\n\n**Li Jin** is a cofounder and General Partner of [Variant](https://variant.fund/), a venture capital firm focused on investing in web3 and the ownership economy.\n\n**Katie Parrott** is a writer and editor at [Every](https://every.to/), a media company publishing essays and analysis focusing on business.",
    "timestamp": "1653336630",
    "title": "A Theory of Justice for Web3"
  },
  "digest": "RJgUZXii6K29b37NH6giZqDOMT5CQZjL38xmRltGHuU",
  "authorship": {
    "contributor": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C",
    "signingKey": "{\"crv\":\"P-256\",\"ext\":true,\"key_ops\":[\"verify\"],\"kty\":\"EC\",\"x\":\"cYDxu5I0Gxy6-VhczONY3QvohJtbZ7yJ1wcjLdPvjXI\",\"y\":\"EEHecnTtwmBeg9KAgH86Pz0n19w9DZ5KZG8J1q2YPFk\"}",
    "signature": "0xd4bb98372bf0b5f58825104199f69394d4f6f618cc7d2d49fcf52ceac8716a47623094f82e8be98405677f9cff5c7f383acbd7b086ef4798c710831b02e223971c",
    "signingKeySignature": "6hNucev3u8rEf9ofoebIbrFFl38ujgOkaeplsbSXQ-cl9gqYixWG9cy7zxmXA1STIyT2XcGePonIQoyEvbXNkw",
    "signingKeyMessage": "I authorize publishing on mirror.xyz from this device using:\n{\"crv\":\"P-256\",\"ext\":true,\"key_ops\":[\"verify\"],\"kty\":\"EC\",\"x\":\"cYDxu5I0Gxy6-VhczONY3QvohJtbZ7yJ1wcjLdPvjXI\",\"y\":\"EEHecnTtwmBeg9KAgH86Pz0n19w9DZ5KZG8J1q2YPFk\"}",
    "algorithm": {
      "name": "ECDSA",
      "hash": "SHA-256"
    }
  },
  "version": "04-25-2022",
  "wnft": {
    "chainId": 10,
    "description": "Originally published in Harvard Business Review\n",
    "fee": 250,
    "fundingRecipient": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C",
    "imageURI": "bafkreide7guuuii3v47oedcay6qgdeucujkpsbnmwee7o6jrg2hhqfamu4",
    "mediaAssetId": 75202,
    "name": "A Theory of Justice for Web3",
    "nonce": 8894230,
    "owner": "0x808a2adbD0a3fc679e3F7CD18d4f579BFCaaEC9C",
    "price": 0.05,
    "proxyAddress": "0x102c11dAEDb2ae66548DB142eb686A60Fff2e2C5",
    "renderer": "0x0000000000000000000000000000000000000000",
    "supply": 200,
    "symbol": "ATHEORYOFJUSTICEFORWEB3"
  }
}